/********************************************************************************
Right Reserve:	BMS Technology Co., Ltd
Project:		BMS
File Name:		PylontechProtocolCan.h
Author:			BMSTeam
Date:			2023.07.01
Description:	上海派能能源科技有限公司,逆变器与电池通信协议(CAN)
********************************************************************************/
#ifndef __PYLON_PROTOCOL_CAN_H__
#define __PYLON_PROTOCOL_CAN_H__

/********************************************************************************
* Include head files															*
********************************************************************************/
#include		"OS_CPU.h"

/********************************************************************************
* Macros 																		*
********************************************************************************/
#ifdef	__PYLON_PROTOCOL_CAN_C__
#define	PYLON_PROTOCOL_CAN
#else
#define	PYLON_PROTOCOL_CAN	extern
#endif

#define PYLON_PROTOCOL_CAN_ENABLE		1

/********************************************************************************
* Routines' implementations														*
********************************************************************************/
PYLON_PROTOCOL_CAN void	sPylonProtCanPolling(INT8U canid,INT8U Filter1,INT8U Filter2);

/********************************************************************************
* Output interface Routines														*
********************************************************************************/


/********************************************************************************
* Input interface Routines														*
********************************************************************************/


#endif	// __PYLON_PROTOCOL_CAN_H__

